# pandas From Scratch


Data Structures, Series and Dataframe
______________________

**Source**
[Python for Data Analysis Ch05, by Wes McKinney](https://github.com/wesm/pydata-book/blob/2nd-edition/ch05.ipynb)

______________________

__**pandas**__ is a Python toolkit optimized for building data structures and data cleaning operations. Works with tabular or heterogeneous data sets, unlike Numpy which perfers homogeneous numerical data.  Similar to Numpy array-based functions, processing with out FOR loops.  Many applications can begin with either Series or Dataframes.

In [3]:
import pandas as pd

In [4]:
from pandas import Series, DataFrame

In [5]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

## pandas Series

**Series**

A sequence of values matched to its index. An *index* is an array of data labels, the 
A one-dimensional array-like object, default index will start at 0.  Option to use strings as indexes, you can select one plus values if quoted in the call function.

Series concept: a fixed-length, ordered dictionary.

In [22]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [ ]:
obj.values
obj.index  # like range(4)

In [ ]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2
obj2.index

In [ ]:
#quote the index value if not numeric
obj2['a']
obj2['d'] = 6
obj2[['c', 'a', 'd']]

In [ ]:
#operations against the object to not change index-value relationship
obj2[obj2 > 0]
obj2 * 2
np.exp(obj2)

In [ ]:
#Similar to dict usages
'b' in obj2
'e' in obj2

In [5]:
#sdata starts as a dictionary, pass into pandas to create a series
sdata = {'Camelot': 33350100, 'Castle Anthrax': 7105400, 'Oregon': 1643000, 'Spamtowne': 555000}
obj3 = pd.Series(sdata)
obj3

Camelot           33350100
Castle Anthrax     7105400
Oregon             1643000
Spamtowne           555000
dtype: int64

In [6]:
#you can specify the returned key order, defaults to softed 
#Utopia does not exist in the series
states = ['Utopia', 'Spamtowne', 'Oregon', 'Camelot']
obj4 = pd.Series(sdata, index=states)
obj4

Utopia              NaN
Spamtowne      555000.0
Oregon        1643000.0
Camelot      33350100.0
dtype: float64

In [12]:
#detect if data object has nulls
print('$----test null----$\n', pd.isnull(obj4))
print('$----test not null----$\n', pd.notnull(obj4))

$----test null----$
 Utopia        True
Spamtowne    False
Oregon       False
Camelot      False
dtype: bool
$----test not null----$
 Utopia       False
Spamtowne     True
Oregon        True
Camelot       True
dtype: bool

In [19]:
#optional to use instance methods
print(obj3.isnull())
print('$$-----------more---------$$')
print(obj4.isnull())

Camelot           False
Castle Anthrax    False
Oregon            False
Spamtowne         False
dtype: bool
$$-----------more---------$$
Utopia        True
Spamtowne    False
Oregon       False
Camelot      False
dtype: bool

In [20]:
#Series auto align by index labels in math operations, similar to database joins
print(obj3 + obj4)

Camelot           66700200.0
Castle Anthrax           NaN
Oregon             3286000.0
Spamtowne          1110000.0
Utopia                   NaN
dtype: float64

In [ ]:
#the series object and index 
obj4.name = 'population'
obj4.index.name = 'state'
obj4

In [27]:
obj.index = ['Lancelot', 'Thripshaw', 'Boubacar', 'Camara']
print(obj)

Lancelot     4
Thripshaw    7
Boubacar    -5
Camara       3
dtype: int64

### DataFrame


_________________
*Dataframes* are order collections of various type columns. Stored as 2-dimensional arrays, indexed by columns and rows, basically a dictionary that contains series with the same index. Stored as 2D blocks, but can be used in higher dimensional data by using hierarchical indexing. The lists have to have the same length, index is assigned if you do not assign it.

In [7]:
data = {'country': ['Senegal', 'Mali', 'Gambia', 'Guinee', 'Burkina Faso', 'Ghana'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.3, 1.6, 3.6, 2.4, 22.9, 35.2]}
frame = pd.DataFrame(data)

In [8]:
#the columns should result in alphabetical order by 
frame

        country  year   pop
0       Senegal  2000   1.3
1          Mali  2001   1.6
2        Gambia  2002   3.6
3        Guinee  2001   2.4
4  Burkina Faso  2002  22.9
5         Ghana  2003  35.2

In [9]:
frame.head() #defaults to first five rows

        country  year   pop
0       Senegal  2000   1.3
1          Mali  2001   1.6
2        Gambia  2002   3.6
3        Guinee  2001   2.4
4  Burkina Faso  2002  22.9

In [10]:
#specify the column order
pd.DataFrame(data, columns=['year', 'country', 'pop'])

   year       country   pop
0  2000       Senegal   1.3
1  2001          Mali   1.6
2  2002        Gambia   3.6
3  2001        Guinee   2.4
4  2002  Burkina Faso  22.9
5  2003         Ghana  35.2

In [11]:
#create a dataframe, if you pass in a crocodile then it fills with NaN
frame2 = pd.DataFrame(data, columns=['year', 'country', 'pop', 'crocodiles'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
print(frame2)
print(frame2.columns)

       year       country   pop crocodiles
one    2000       Senegal   1.3        NaN
two    2001          Mali   1.6        NaN
three  2002        Gambia   3.6        NaN
four   2001        Guinee   2.4        NaN
five   2002  Burkina Faso  22.9        NaN
six    2003         Ghana  35.2        NaN
Index(['year', 'country', 'pop', 'crocodiles'], dtype='object')

In [14]:
#return a column by dictionary-like notation or attribute
print(frame2['country'])

one           Senegal
two              Mali
three          Gambia
four           Guinee
five     Burkina Faso
six             Ghana
Name: country, dtype: object

In [15]:
print(frame2.year)

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [16]:
#retrieve a row by position or name 
frame2.loc['four']

year            2001
country       Guinee
pop              2.4
crocodiles       NaN
Name: four, dtype: object

In [20]:
#you can assign a value for each row
#frame2['crocodiles'] = 17.56
frame2['crocodiles'] = np.arange(6.)
print(frame2)

       year       country   pop  crocodiles
one    2000       Senegal   1.3         0.0
two    2001          Mali   1.6         1.0
three  2002        Gambia   3.6         2.0
four   2001        Guinee   2.4         3.0
five   2002  Burkina Faso  22.9         4.0
six    2003         Ghana  35.2         5.0

In [39]:
#example of the length not matching, it fills in the missing values with NaN
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['crocodiles'] = val
frame2

       year       country   pop  crocodiles
one    2000       Senegal   1.3         NaN
two    2001          Mali   1.6        -1.2
three  2002        Gambia   3.6         NaN
four   2001        Guinee   2.4        -1.5
five   2002  Burkina Faso  22.9        -1.7
six    2003         Ghana  35.2         NaN

In [41]:
#create a new column, assign a boolean where country equals Senegal
#have to use square brackets when creating, later you can return without
frame2['western'] = frame2.country == 'Senegal'
frame2

       year       country   pop  crocodiles  western
one    2000       Senegal   1.3         NaN     True
two    2001          Mali   1.6        -1.2    False
three  2002        Gambia   3.6         NaN    False
four   2001        Guinee   2.4        -1.5    False
five   2002  Burkina Faso  22.9        -1.7    False
six    2003         Ghana  35.2         NaN    False

In [42]:
#remove the column created above, should return a list of what is still there
del frame2['western']
frame2.columns

Index(['year', 'country', 'pop', 'crocodiles'], dtype='object')

In [22]:
#create a nested dictionary of dictionaries
#pandas will default to inner keys as row indices and outer dict keys as columns
pop = {'Coleoptera': {3001: 2.48, 4002: 2.79},
       'Lepidoptera': {3000: 1.15, 5001: 12.7, 7003: 33.6}}

In [23]:
frame3 = pd.DataFrame(pop)
frame3

      Coleoptera  Lepidoptera
3000         NaN         1.15
3001        2.48          NaN
4002        2.79          NaN
5001         NaN        12.70
7003         NaN        33.60

In [24]:
#Transpose, swap the columns and row, similar syntax to Numpy arrays
#the inner dict keys mix together and sort to create the index
frame3.T

             3000  3001  4002  5001  7003
Coleoptera    NaN  2.48  2.79   NaN   NaN
Lepidoptera  1.15   NaN   NaN  12.7  33.6

In [25]:
#sort the keys in the order you specify 
#inner dict keys are mixed and sorted if you are not explicit
pd.DataFrame(pop, index=[3001, 5001, 4002])

      Coleoptera  Lepidoptera
3001        2.48          NaN
5001         NaN         12.7
4002        2.79          NaN

In [26]:
pdata = {'Coleopter': frame3['Coleoptera'][:-1],
         'Lepidoptera': frame3['Lepidoptera'][:2]}
pd.DataFrame(pdata)

      Coleopter  Lepidoptera
3000        NaN         1.15
3001       2.48          NaN
4002       2.79          NaN
5001        NaN          NaN

In [ ]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

In [ ]:
frame3.values

In [ ]:
frame2.values

### Index Objects

In [ ]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index
index[1:]

index[1] = 'd'  # TypeError

In [ ]:
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2
obj2.index is labels

In [ ]:
frame3
frame3.columns
'Ohio' in frame3.columns
2003 in frame3.index

In [ ]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

## Essential Functionality

### Reindexing

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

In [ ]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3
obj3.reindex(range(6), method='ffill')

In [ ]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

In [ ]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

In [ ]:
frame.loc[['a', 'b', 'c', 'd'], states]

### Dropping Entries from an Axis

In [ ]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj
new_obj = obj.drop('c')
new_obj
obj.drop(['d', 'c'])

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

In [ ]:
data.drop(['Colorado', 'Ohio'])

In [ ]:
data.drop('two', axis=1)
data.drop(['two', 'four'], axis='columns')

In [ ]:
obj.drop('c', inplace=True)
obj

### Indexing, Selection, and Filtering

In [ ]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj
obj['b']
obj[1]
obj[2:4]
obj[['b', 'a', 'd']]
obj[[1, 3]]
obj[obj < 2]

In [ ]:
obj['b':'c']

In [ ]:
obj['b':'c'] = 5
obj

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data
data['two']
data[['three', 'one']]

In [ ]:
data[:2]
data[data['three'] > 5]

In [ ]:
data < 5
data[data < 5] = 0
data

#### Selection with loc and iloc

In [ ]:
data.loc['Colorado', ['two', 'three']]

In [ ]:
data.iloc[2, [3, 0, 1]]
data.iloc[2]
data.iloc[[1, 2], [3, 0, 1]]

In [ ]:
data.loc[:'Utah', 'two']
data.iloc[:, :3][data.three > 5]

### Integer Indexes

ser = pd.Series(np.arange(3.))
ser
ser[-1]

In [ ]:
ser = pd.Series(np.arange(3.))

In [ ]:
ser

In [ ]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

In [ ]:
ser[:1]
ser.loc[:1]
ser.iloc[:1]

### Arithmetic and Data Alignment

In [ ]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
s1
s2

In [ ]:
s1 + s2

In [ ]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1
df2

In [ ]:
df1 + df2

In [ ]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1
df2
df1 - df2

#### Arithmetic methods with fill values

In [ ]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df1
df2

In [ ]:
df1 + df2

In [ ]:
df1.add(df2, fill_value=0)

In [ ]:
1 / df1
df1.rdiv(1)

In [ ]:
df1.reindex(columns=df2.columns, fill_value=0)

#### Operations between DataFrame and Series

In [ ]:
arr = np.arange(12.).reshape((3, 4))
arr
arr[0]
arr - arr[0]

In [ ]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame
series

In [ ]:
frame - series

In [ ]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

In [ ]:
series3 = frame['d']
frame
series3
frame.sub(series3, axis='index')

### Function Application and Mapping

In [ ]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame
np.abs(frame)

In [ ]:
f = lambda x: x.max() - x.min()
frame.apply(f)

In [ ]:
frame.apply(f, axis='columns')

In [ ]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

In [ ]:
format = lambda x: '%.2f' % x
frame.applymap(format)

In [ ]:
frame['e'].map(format)

### Sorting and Ranking

In [ ]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

In [ ]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()
frame.sort_index(axis=1)

In [ ]:
frame.sort_index(axis=1, ascending=False)

In [ ]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

In [ ]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

In [ ]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame
frame.sort_values(by='b')

In [ ]:
frame.sort_values(by=['a', 'b'])

In [ ]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

In [ ]:
obj.rank(method='first')

In [ ]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

In [ ]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame
frame.rank(axis='columns')

### Axis Indexes with Duplicate Labels

In [ ]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

In [ ]:
obj.index.is_unique

In [ ]:
obj['a']
obj['c']

In [ ]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df
df.loc['b']

## Summarizing and Computing Descriptive Statistics

In [ ]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

In [ ]:
df.sum()

In [ ]:
df.sum(axis='columns')

In [ ]:
df.mean(axis='columns', skipna=False)

In [ ]:
df.idxmax()

In [ ]:
df.cumsum()

In [ ]:
df.describe()

In [ ]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

### Correlation and Covariance

conda install pandas-datareader

In [ ]:
price = pd.read_pickle('examples/yahoo_price.pkl')
volume = pd.read_pickle('examples/yahoo_volume.pkl')

import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [ ]:
returns = price.pct_change()
returns.tail()

In [ ]:
returns['MSFT'].corr(returns['IBM'])
returns['MSFT'].cov(returns['IBM'])

In [ ]:
returns.MSFT.corr(returns.IBM)

In [ ]:
returns.corr()
returns.cov()

In [ ]:
returns.corrwith(returns.IBM)

In [ ]:
returns.corrwith(volume)

### Unique Values, Value Counts, and Membership

In [ ]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [ ]:
uniques = obj.unique()
uniques

In [ ]:
obj.value_counts()

In [ ]:
pd.value_counts(obj.values, sort=False)

In [ ]:
obj
mask = obj.isin(['b', 'c'])
mask
obj[mask]

In [ ]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

In [ ]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

In [ ]:
result = data.apply(pd.value_counts).fillna(0)
result

## Conclusion

In [ ]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS